tripaide/app/models/user.rb

    def reset_session_token!
        # When a user logs out, we want to scramble their session_token so that bad people cannot use the old one
        self.session_token = SecureRandom.urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "xDqRNGVq0AEIsnORcYzLKg"], ["updated_at", "2022-07-08 23:54:28.020550"], ["id", 4]]